{
  "Adho Mukha Svanasana": ["Downward-Facing Dog Pose", "A foundational yoga pose that strengthens the arms and legs while stretching the spine."],
  "Adho Mukha Vrksasana": ["Handstand Pose", "An inversion that builds strength in the shoulders and core while improving balance."],
  "Anjaneyasana": ["Low Lunge Pose", "Opens the hips, stretches the thighs, and improves flexibility in the hip flexors."],
  "Ardha Chandrasana": ["Half Moon Pose", "Develops balance and stability, strengthens the legs, and stretches the sides of the body."],
  "Ardha Pincha Mayurasana": ["Dolphin Pose", "Prepares the body for more advanced inversions, strengthening the arms and shoulders."],
  "Ashta Chandrasana": ["Eight-Limbed Crescent Moon Pose", "Combines strength and balance, opening the chest and improving flexibility."],
  "Baddha Konasana": ["Bound Angle Pose", "Opens the hips, improves flexibility, and stimulates the reproductive organs."],
  "Bakasana": ["Crow Pose", "Arm balance that strengthens the wrists, arms, and abdominal muscles."],
  "Balasana": ["Child's Pose", "Restorative pose that helps release tension in the back, neck, and shoulders."],
  "Bitilasana": ["Cow Pose", "A gentle spinal warm-up that improves flexibility and coordination."],
  "Dhanurasana": ["Bow Pose", "Backbend that strengthens the back muscles and improves posture."],
  "Halasana": ["Plow Pose", "Stretches the spine, shoulders, and hamstrings, and stimulates the abdominal organs."],
  "Hanumanasana": ["Monkey Pose", "Deep stretch for the hamstrings and hip flexors, improving flexibility."],
  "Malasana": ["Garland Pose", "Strengthens the lower back, ankles, and tones the abdominal muscles."],
  "Marjaryasana": ["Cat Pose", "A gentle stretch for the back and neck, promoting flexibility and spinal mobility."],
  "Padmasana": ["Lotus Pose", "Promotes flexibility in the hips and knees, and encourages good posture."],
  "Phalakasana": ["Plank Pose", "Strengthens the core muscles, arms, and wrists."],
  "Pincha Mayurasana": ["Forearm Stand", "Inversion that strengthens the shoulders, arms, and core."],
  "Salamba Bhujangasana": ["Sphinx Pose", "Mild backbend that helps improve posture and strengthen the spine."],
  "Ustrasana": ["Camel Pose", "Backbend that stretches the front of the body, opening the chest and hips."],
  "Uttanasana": ["Standing Forward Bend", "Stretches the hamstrings and spine, releasing tension."],
  "Utthita Hasta Padangusthasana": ["Extended Hand-to-Big-Toe Pose", "Improves balance and flexibility, especially in the hamstrings."],
  "Vasisthasana": ["Side Plank Pose", "Strengthens the arms, core, and legs while improving balance."],
  "Vrksasana": ["Tree Pose", "Strengthens the legs, improves balance, and promotes focus and concentration."]
}
